[
  {
    "title": "Engineering Intern",
    "company": "Commvault Systems",
    "from": "May 2024",
    "to": "Jan 2025",
    "location": "Tinton Falls, New Jersey",
    "summary": "Developed an AI-powered log analysis tool, optimized log processing, and implemented a PCA-based anomaly detection system to analyze Azure Storage transactions.",
    "skills": [
      "Python",
      "Vertex AI",
      "Azure ML Studio",
      "Synapse Analytics",
      "KQL",
      "Azure Storage",
      "DevOps"
    ],
    "jobDescription": [
      "Engineered a scalable AI log analysis tool using Vertex AI and Python, diagnosing job failures and processing 300+ requests daily for cloud-based solutions.",
      "Developed a multithreaded grep tool for parallel log search, aggregating and parsing distributed logs to reduce data volume by 70% while ensuring security through log masking.",
      "Built a PCA-based anomaly detection system in Azure ML Studio and Synapse Analytics to monitor 10,000+ daily delete transactions in Azure Storage, optimizing query performance with KQL and automating pipelines."
    ]
  },
  {
    "title": "Software Engineer",
    "company": "Commvault Systems",
    "from": "Jan 2021",
    "to": "Jul 2023",
    "location": "Bengaluru, India",
    "summary": "Developed automation frameworks, optimized cloud resource management, enhanced backup solutions, and mentored interns in DevOps and automation.",
    "skills": [
      "Python",
      "Selenium",
      "Jenkins",
      "Azure VMs",
      "Azure SQL Database",
      "Azure Load Balancer",
      "AWS EC2",
      "Amazon RDS",
      "AWS Elastic Load Balancer",
      "CloudWatch",
      "AWS Lambda",
      "Terraform",
      "Ansible",
      "Azure Monitor",
      "Azure Automation",
      "DevOps"
    ],
    "jobDescription": [
      "Developed and maintained automation frameworks using Python and Selenium, integrating with Jenkins for CI/CD to enhance backup reliability and cut regression testing time by 40%.",
      "Configured and maintained internal production test environments using Azure VMs, Azure SQL Database, and Azure Load Balancer, ensuring high availability and scalability for web servers and database instances.",
      "Configured and maintained internal production test environments using AWS EC2 instances, Amazon RDS, and AWS Elastic Load Balancer, ensuring high availability and scalability for web servers and database instances.",
      "Used Azure Monitor, Azure Automation, and Azure Load Balancer to monitor load on Azure VSA agents and automatically power on/off agents based on load conditions, ensuring efficient resource utilization and scalability.",
      "Used CloudWatch, AWS Lambda, and AWS Elastic Load Balancer to monitor load on AWS EC2 instances and automatically start/stop instances based on load conditions, ensuring efficient resource utilization and scalability.",
      "Created Terraform and Ansible scripts to automate cloud resource management on Azure and AWS, identifying redundant resources to reduce manual effort and cut cloud service costs by 40%.",
      "Engineered Ansible and Terraform playbooks to streamline the onboarding, configuration, and management of 500+ Commvault virtualization clients, reducing manual effort and accelerating deployment times.",
      "Resolved 30+ critical issues as a Subject Matter Expert (SME) for Microsoft Hyper-V and Azure solutions, attended POC sessions, and significantly boosted system reliability and customer satisfaction.",
      "Mentored interns in DevOps, infrastructure automation, and version control, enhancing team productivity."
    ]
  },
  {
    "title": "Associate Software Engineer",
    "company": "Commvault Systems",
    "from": "Jan 2020",
    "to": "Dec 2020",
    "location": "Bengaluru, India",
    "summary": "Contributed to AutoCenter, an internal test case management platform, automated cloud resource scaling, and improved Azure and AWS agent performance.",
    "skills": [
      "Python",
      "Django",
      "JavaScript",
      "Azure",
      "AWS",
      "Terraform",
      "Ansible",
      "PowerShell",
      "Selenium",
      "CI/CD"
    ],
    "jobDescription": [
      "Contributed to AutoCenter, a web application managing 2000+ test cases, using Django and JavaScript to enhance test scheduling, reporting, and monitoring capabilities.",
      "Automated the verification of auto-scaling for Azure and AWS (EC2) by executing performance and load testing procedures, ensuring accurate scaling, optimized resource usage, and efficient idle agent cleanup.",
      "Built and maintained API automation frameworks integrated into CI/CD pipelines, ensuring smooth deployments and reliable backend testing."
    ]
  }
]
